src_ext/DataProcessors/УЗ_ПанельУченика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_ПанельУченика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/DataProcessors/УЗ_ПанельУченика/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УченикПриИзмененииНаСервере();		//параметр «Ученик» списка уроков — до первого чтения списка
	//остаток денег по предмету: «+» — оплачено вперёд, «−» — долг; цвета — палитра продукта
	УЗ_Общий.ОформитьОстатокДенег(УсловноеОформление, "АктивныеГруппыОбученияЗадолженность",
		"АктивныеГруппыОбучения.Задолженность");

	//C03/В12: организация панели — в новых уроках и перемещениях денег, остатки — по ней; по умолчанию из настроек
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Организации.Ссылка КАК Ссылка ИЗ Справочник.Организации КАК Организации");
	Элементы.Организация.Видимость = НЕ Запрос.Выполнить().Пустой();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УченикПриИзмененииНаСервере();
	ОпределитьАктивныеГруппыОбучения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УченикПриИзменении(Элемент)

	УченикПриИзмененииНаСервере();
	ОпределитьАктивныеГруппыОбучения();

	Элементы.АктивныеГруппыОбучения.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Ученик);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАктивныеГруппыОбучения

&НаКлиенте
Процедура АктивныеГруппыОбученияДействиеПриИзменении(Элемент)

	ТекДанные = Элементы.АктивныеГруппыОбучения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекДанные.Действие = "Перевести" Тогда
		Элементы.АктивныеГруппыОбученияГруппаОбучения2.Видимость = Истина;
	ИначеЕсли ТекДанные.Действие = "ПеремещениеДенег" Тогда
		//колонки «Из предмета», «В предмет», «Сумма» нужны только этому действию (стандарт форм п.10: до 8 колонок)
		Элементы.АктивныеГруппыОбученияГруппаПеремещение.Видимость = Истина;
	КонецЕсли;
	РассчитатьПериоды(?(ТекДанные.Действие = "Продлить", "СледующийМесяц", Неопределено));

КонецПроцедуры

&НаКлиенте
Процедура АктивныеГруппыОбученияПриИзменении(Элемент)

	Если Элемент.ТекущийЭлемент.Имя <> "АктивныеГруппыОбученияВыб" Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.Выб = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктивныеГруппыОбученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элементы.АктивныеГруппыОбучения.ТекущиеДанные;
	Если Поле.Имя = "АктивныеГруппыОбученияЗадолженность" Тогда

		Если Не ЗначениеЗаполнено(ТекДанные.ГруппаОбучения) Тогда
			Сообщить("Не выбрана ГруппаОбучения! Нельзя формировать взаиморасчеты!");
			Возврат;
		КонецЕсли;

		ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(ТекДанные.ГруппаОбучения);
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);

	ИначеЕсли Поле.Имя = "АктивныеГруппыОбученияПериод" Тогда
		СтандартнаяОбработка = Ложь;

		Пар = Новый Структура("СписокДат", ТекДанные.Период);
		Пар.Вставить("ГруппаОбучения",ТекДанные.ГруппаОбучения);

		Если ТекДанные.Действие = "Продлить" Тогда
			//месяц по умолчанию — по дате сервера, как в РассчитатьПериоды (было: часы компьютера пользователя)
			Сегодня = УЗ_Сервер.ДатаСеанса();
			Пар.Вставить("ДатаНач",
				?(ЗначениеЗаполнено(Период.ДатаНачала),КонецМесяца(Период.ДатаНачала)+1,КонецМесяца(Сегодня)+1));
			Пар.Вставить("ДатаКон",
				?(ЗначениеЗаполнено(Период.ДатаОкончания),КонецМесяца(КонецМесяца(Период.ДатаОкончания)+1),
				КонецМесяца(КонецМесяца(Сегодня)+1)));
		Иначе
			Сегодня = УЗ_Сервер.ДатаСеанса();
			Пар.Вставить("ДатаНач",?(ЗначениеЗаполнено(Период.ДатаНачала),Период.ДатаНачала,НачалоМесяца(Сегодня)));
			Пар.Вставить("ДатаКон",
				?(ЗначениеЗаполнено(Период.ДатаОкончания),Период.ДатаОкончания,КонецМесяца(Сегодня)));
		КонецЕсли;

		Завершение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект, ТекДанные.ПолучитьИдентификатор());
		ОткрытьФорму("Обработка.УЗ_ПанельУченика.Форма.ФормаВыбораПериода", Пар, ЭтотОбъект,
			ЭтаФорма.УникальныйИдентификатор,
			ВариантОткрытияОкна.ОтдельноеОкно, , Завершение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЗОписание

&НаКлиенте
Процедура ТЗОписаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ТЗОписаниеУрок" Тогда
		Док = Элементы.ТЗОписание.ТекущиеДанные.Урок;
		ПоказатьЗначение(,Док);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выполнить1(Команда)
	ТЗОписание.Очистить();
	Сч = 0;

	ЕстьВыбранные = Ложь;
	Для Каждого Стр из АктивныеГруппыОбучения Цикл
		Если Стр.Выб Тогда
			ЕстьВыбранные = Истина;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЕстьВыбранные Тогда
		Сч = Сч + 1;
		НовСтр = ТЗОписание.Добавить();
		НовСтр.Номер = Сч;
		НовСтр.Описание = "Не отмечены галочки!";
	КонецЕсли;

	Выполнить1НаСервере();
	Элементы.СписокУроков.Обновить();

	Сч = Сч + 1;
	НовСтр = ТЗОписание.Добавить();
	НовСтр.Номер = Сч;
	НовСтр.Описание = "Завершено!";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Уроки ученика: «Сумма ученика» — сумма его строки в уроке (было: сумма всего урока — 4 800 за группу вместо 900
//ученика, дефект №7 снимков). Без ученика список пуст.
&НаСервере
Процедура УченикПриИзмененииНаСервере()

	СписокУроков.Параметры.УстановитьЗначениеПараметра("Ученик", Ученик);

КонецПроцедуры

//Группы ученика за период: по движениям (проведённые уроки) и по урокам, где он записан, — в том числе
//будущим, записанным без проведения (В10). «Остаток денег» — сумма остатков по предмету группы в организации
//панели (В12: деньги ученика раздельно по организациям, как взаиморасчёты в типовых).
&НаСервере
Процедура ОпределитьАктивныеГруппыОбучения()

	АктивныеГруппыОбучения.Очистить();
	ОбновитьСводку();

	Если НЕ ЗначениеЗаполнено(Ученик) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Обороты.ГруппаОбучения КАК ГруппаОбучения
	|ПОМЕСТИТЬ ВТ_Группы
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.Обороты(&НачалоПериода, &КонецПериода, , Клиент = &Клиент) КАК Обороты
	|ГДЕ
	|	Обороты.ГруппаОбучения <> ЗНАЧЕНИЕ(Справочник.УЗ_ГруппыОбучения.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УрокУченики.Ссылка.ГруппаОбучения
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УрокУченики
	|ГДЕ
	|	УрокУченики.Ученик = &Клиент
	|	И НЕ УрокУченики.Ссылка.ПометкаУдаления
	|	И УрокУченики.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УрокУченики.Ссылка.ГруппаОбучения <> ЗНАЧЕНИЕ(Справочник.УЗ_ГруппыОбучения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ПредметОбучения КАК ПредметОбучения,
	|	СУММА(Остатки.СуммаОстаток) КАК Остаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.Остатки(, Клиент = &Клиент И Организация = &Организация) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ПредметОбучения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Группы.ГруппаОбучения КАК ГруппаОбучения,
	|	ЕСТЬNULL(ВТ_Остатки.Остаток, 0) КАК Остаток
	|ИЗ
	|	ВТ_Группы КАК ВТ_Группы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Группы.ГруппаОбучения.ПредметОбучения = ВТ_Остатки.ПредметОбучения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Группы.ГруппаОбучения.Наименование";
	Запрос.УстановитьПараметр("Клиент", Ученик);
	Запрос.УстановитьПараметр("Организация", Организация);
	Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода",
			?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, '29991231'));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", '00010101');
		Запрос.УстановитьПараметр("КонецПериода", '29991231');
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АктГруппаОбуч = АктивныеГруппыОбучения.Добавить();
		АктГруппаОбуч.ГруппаОбучения = Выборка.ГруппаОбучения;
		АктГруппаОбуч.Задолженность = Выборка.Остаток;
		АктГруппаОбуч.ОсталосьУроков = Обработки.УЗ_ПанельУченика.ОсталосьУроковТекстом(Ученик,
			Выборка.ГруппаОбучения, АктГруппаОбуч.Задолженность, Организация);
	КонецЦикла;

КонецПроцедуры

//Сводка над таблицами (Обработки.УЗ_ПанельУченика.СводкаУченика): ФИО, деньги по предметам со знаком и цветом
//палитры (плюс — переплата, минус — долг), абонементы «Осталось уроков 3 из 8», ближайший урок.
&НаСервере
Процедура ОбновитьСводку()

	Если Не ЗначениеЗаполнено(Ученик) Тогда
		Элементы.Сводка.Заголовок =
			НСтр("ru = 'Выберите ученика — здесь появятся его деньги по предметам, абонементы и ближайший урок'");
		Возврат;
	КонецЕсли;
	Сводка = Обработки.УЗ_ПанельУченика.СводкаУченика(Ученик, Организация);
	Жирный = Новый Шрифт(, , Истина);
	Части = Новый Массив;
	Части.Добавить(Новый ФорматированнаяСтрока(Строка(Ученик), Жирный));

	Части.Добавить(Символы.ПС + НСтр("ru = 'Деньги: '"));
	Если Сводка.Остатки.Количество() = 0 Тогда
		Части.Добавить(НСтр("ru = 'долгов и переплат нет'"));
	КонецЕсли;
	Для Поз = 0 По Сводка.Остатки.Количество() - 1 Цикл
		СтрокаОстатка = Сводка.Остатки[Поз];
		Части.Добавить(?(Поз = 0, "", " · ") + СтрокаОстатка.Предмет + " ");
		Части.Добавить(
			Новый ФорматированнаяСтрока(УЗ_ОбщийКлиентСервер.ПредставлениеОстаткаДенег(СтрокаОстатка.Остаток), ,
			?(СтрокаОстатка.Остаток > 0, УЗ_ОбщийКлиентСервер.ЦветПлюсаДенег(),
				УЗ_ОбщийКлиентСервер.ЦветМинусаДенег())));
	КонецЦикла;

	Для Каждого Абонемент Из Сводка.Абонементы Цикл
		Части.Добавить(Символы.ПС + НСтр("ru = 'Абонемент'") + " " + Абонемент.Название + ": ");
		Части.Добавить(Новый ФорматированнаяСтрока(Абонемент.Текст, ,
			?(Абонемент.Исчерпан Или Абонемент.Приостановлен, УЗ_ОбщийКлиентСервер.ЦветМинусаДенег(), Неопределено)));
	КонецЦикла;

	Если Сводка.БлижайшийУрок <> Неопределено Тогда
		Части.Добавить(Символы.ПС + НСтр("ru = 'Ближайший урок: '")
			+ Формат(Сводка.БлижайшийУрок.Дата, "ДФ='ddd dd.MM HH:mm'")
			+ ?(ПустаяСтрока(Сводка.БлижайшийУрок.Предмет), "", ", " + Сводка.БлижайшийУрок.Предмет));
	Иначе
		Части.Добавить(Новый ФорматированнаяСтрока(Символы.ПС + НСтр("ru = 'Ближайших уроков нет'"), ,
			УЗ_ОбщийКлиентСервер.ЦветПояснения()));
	КонецЕсли;
	Элементы.Сводка.Заголовок = Новый ФорматированнаяСтрока(Части);

КонецПроцедуры

&НаСервере
Процедура Выполнить1НаСервере()

	Для Каждого СтрТЗ из АктивныеГруппыОбучения Цикл

		Если НЕ СтрТЗ.Выб Тогда
			Продолжить;
		КонецЕсли;

		Если СтрТЗ.Действие = "ПеремещениеДенег" Тогда
			//деньгам не нужны ни группа, ни даты уроков
			ПеремещениеДенег(СтрТЗ);
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрТЗ.ГруппаОбучения) Тогда
			ДобавитьОписание("", "Не выбрана группа обучения!");
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрТЗ.Период) Тогда
			ДобавитьОписание(СтрТЗ.Действие, "Не выбраны даты уроков (колонка «Период»)!");
			Продолжить;
		КонецЕсли;

		Если СтрТЗ.Действие = "Продлить" Тогда
			ДобавитьИтог(СтрТЗ, "Продление",
				Обработки.УЗ_ПанельУченика.ЗаписатьУченикаВГруппу(Ученик, СтрТЗ.ГруппаОбучения, СтрТЗ.Период,
					СтрТЗ.Скидка, Организация));
		ИначеЕсли СтрТЗ.Действие = "Добавить" Тогда
			ДобавитьИтог(СтрТЗ, "Добавление",
				Обработки.УЗ_ПанельУченика.ЗаписатьУченикаВГруппу(Ученик, СтрТЗ.ГруппаОбучения, СтрТЗ.Период,
					СтрТЗ.Скидка, Организация));
		ИначеЕсли СтрТЗ.Действие = "Удалить" Тогда
			ДобавитьИтог(СтрТЗ, "Удаление из группы",
				Обработки.УЗ_ПанельУченика.УдалитьУченикаИзГруппы(Ученик, СтрТЗ.ГруппаОбучения, СтрТЗ.Период));
		ИначеЕсли СтрТЗ.Действие = "Перевести" Тогда
			ДобавитьИтог(СтрТЗ, "Перевод из группы",
				Обработки.УЗ_ПанельУченика.ПеревестиУченика(Ученик, СтрТЗ.ГруппаОбучения, СтрТЗ.ГруппаОбучения2,
					СтрТЗ.Период, СтрТЗ.Скидка, Организация));
		Иначе
			ДобавитьОписание("", "Не выбрано действие!");
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОписание(Действие, Описание, ДопОписание = "", Урок = Неопределено)

	Сч = Сч + 1;
	НовСтр = ТЗОписание.Добавить();
	НовСтр.Номер = Сч;
	НовСтр.Действие = Действие;
	НовСтр.Описание = Описание;
	НовСтр.ДопОписание = ДопОписание;
	НовСтр.Урок = Урок;

КонецПроцедуры

//Строки итога действия: начало, по строке на урок (с документом и тем, что с ним стало), окончание.
&НаСервере
Процедура ДобавитьИтог(СтрТЗ, ИмяДействия, Итог)

	ДобавитьОписание(СтрТЗ.Действие, "Начало. " + ИмяДействия);
	Для Каждого ЭлементИтога Из Итог Цикл
		ДобавитьОписание(СтрТЗ.Действие, ЭлементИтога.Описание, ЭлементИтога.ДопОписание, ЭлементИтога.Урок);
	КонецЦикла;
	ДобавитьОписание(СтрТЗ.Действие, "Окончание. " + ИмяДействия);

КонецПроцедуры

&НаСервере
Процедура ПеремещениеДенег(СтрТЗ)

	ДобавитьОписание(СтрТЗ.Действие, "Начало. ПеремещениеДенег");

	Если НЕ ЗначениеЗаполнено(СтрТЗ.ПредметОбученияОтправитель)
		Или НЕ ЗначениеЗаполнено(СтрТЗ.ПредметОбученияПолучатель)
		Или СтрТЗ.ПредметОбученияОтправитель = СтрТЗ.ПредметОбученияПолучатель Или СтрТЗ.Сумма <= 0 Тогда
		ДобавитьОписание(СтрТЗ.Действие, "Укажите разные «Из предмета» и «В предмет» и сумму больше нуля", "Отказ");
	Иначе
		ПереместитьДеньги(СтрТЗ);
	КонецЕсли;

	ДобавитьОписание(СтрТЗ.Действие, "Окончание. ПеремещениеДенег");

КонецПроцедуры

&НаСервере
Процедура ПереместитьДеньги(СтрТЗ)

	Итог = Обработки.УЗ_ПанельУченика.ПереместитьДеньгиУченика(Ученик, Организация, СтрТЗ.ПредметОбученияОтправитель,
		СтрТЗ.ПредметОбученияПолучатель, СтрТЗ.Сумма);
	ДобавитьОписание(СтрТЗ.Действие, Итог.Описание, Итог.ДопОписание, Итог.Урок);

КонецПроцедуры

//Даты уроков по расписанию групп (Обработки.УЗ_ПанельУченика.ДатыУроковГруппы) за выбранный период,
//а без периода — за текущий месяц; «СледующийМесяц» — следующий за периодом (текущим) месяц.
&НаСервере
Процедура РассчитатьПериоды(ВидРасчета = Неопределено)

	Если ВидРасчета = "СледующийМесяц" Тогда
		ДатаНач = ?(ЗначениеЗаполнено(Период.ДатаНачала),КонецМесяца(Период.ДатаНачала)+1,
			КонецМесяца(ТекущаяДатаСеанса())+1);
		ДатаКон = ?(ЗначениеЗаполнено(Период.ДатаОкончания),КонецМесяца(КонецМесяца(Период.ДатаОкончания)+1),
			КонецМесяца(КонецМесяца(ТекущаяДатаСеанса())+1));
	Иначе
		ДатаНач = ?(ЗначениеЗаполнено(Период.ДатаНачала),Период.ДатаНачала,НачалоМесяца(ТекущаяДатаСеанса()));
		ДатаКон = ?(ЗначениеЗаполнено(Период.ДатаОкончания),Период.ДатаОкончания,КонецМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;

	Для Каждого Стр из АктивныеГруппыОбучения Цикл
		Если ЗначениеЗаполнено(Стр.ГруппаОбучения) Тогда
			Стр.Период = Обработки.УЗ_ПанельУченика.ДатыУроковГруппы(Стр.ГруппаОбучения, ДатаНач, ДатаКон);
			Стр.КолУроков = Стр.Период.Количество();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Даты, выбранные в календаре «Выбор периода»: новый список дат строки (раньше список обнулялся в
//Неопределено, и добавление в него роняло панель); время начала — по расписанию группы в этот день.
&НаСервере
Процедура ЗаполнитьПериодСтроки(ИдентификаторСтроки, ВыбранныеДаты)

	СтрТЗ = АктивныеГруппыОбучения.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрТЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Даты = Новый СписокЗначений;
	Для Каждого ВыбраннаяДата Из ВыбранныеДаты Цикл
		Если ЗначениеЗаполнено(СтрТЗ.ГруппаОбучения) Тогда
			Даты.Добавить(Обработки.УЗ_ПанельУченика.НачалоУрокаГруппы(СтрТЗ.ГруппаОбучения, ВыбраннаяДата));
		Иначе
			Даты.Добавить(ВыбраннаяДата);
		КонецЕсли;
	КонецЦикла;
	Даты.СортироватьПоЗначению();
	СтрТЗ.Период = Даты;
	СтрТЗ.КолУроков = Даты.Количество();

КонецПроцедуры

//Даты, выбранные в календаре «Выбор периода» (окно закрывается с результатом — массивом дат; «Отмена» и крестик —
//Неопределено). Было: глобальное Оповестить всем открытым формам и текущая строка
//таблицы на момент закрытия окна — теперь строка запоминается при открытии (архитектор, 2.3, 28.09.2026).
&НаКлиенте
Процедура ВыборПериодаЗавершение(ВыбранныеДаты, ИдентификаторСтроки) Экспорт

	Если ТипЗнч(ВыбранныеДаты) = Тип("Массив") И ВыбранныеДаты.Количество() > 0 Тогда
		ЗаполнитьПериодСтроки(ИдентификаторСтроки, ВыбранныеДаты);
	КонецЕсли;

КонецПроцедуры

//Отчёт «Взаиморасчёты» по ученику панели, предмету группы и организации панели (В12: деньги по организациям):
//команды отчёта «Оформить приход/перемещение денег» берут ученика, организацию и предмет из этого отбора, а сумму —
//актуальным остатком на сервере (УЗ_Сервер.ЗаполнениеДенежногоДокумента), не из текста ячейки.
&НаСервере
Функция ОткрытьВзаиморасчетыНаСервере(Отбор)

	КомпоновщикНастроек = Отчеты.УЗ_Взаиморасчеты.Создать().КомпоновщикНастроек;
	УстановитьОтборВзаиморасчетов(КомпоновщикНастроек, "Клиент", Ученик);
	УстановитьОтборВзаиморасчетов(КомпоновщикНастроек, "ПредметОбучения", Отбор.ПредметОбучения);
	Если ЗначениеЗаполнено(Организация) Тогда
		УстановитьОтборВзаиморасчетов(КомпоновщикНастроек, "Организация", Организация);
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Вариант", КомпоновщикНастроек.Настройки);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);

	Возврат ПараметрыОткрытия;

КонецФункции

//Отбор «Равно» варианта отчёта по полю (и его пользовательская настройка, если она вынесена в быстрые).
&НаСервереБезКонтекста
Процедура УстановитьОтборВзаиморасчетов(КомпоновщикНастроек, ИмяПоля, Значение)

	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементНастройки Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЭлементОтбораКомпоновкиДанных")
			Или ЭлементНастройки.ЛевоеЗначение <> Поле Тогда
			Продолжить;
		КонецЕсли;
		ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементНастройки.ПравоеЗначение = Значение;
		ЭлементНастройки.Использование = Истина;
		Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
			ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
				ЭлементНастройки.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения;
				ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
				ПользовательскийПараметр.Использование = ЭлементНастройки.Использование;
			КонецЕсли;
		КонецЕсли;
		Прервать;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
